ht32-holtek/HT32_STD_L5xxxx_FWLib/library/HT32L5xxxx_Driver/inc/ht32l5xxxx_gpio.h
/* Exported constants --------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Exported_Constants GPIO exported constants
  * @{
  */

/* Definitions of AFIO_FUN                                                                                  */
#define AFIO_FUN_DEFAULT    AFIO_MODE_DEFAULT  /*!< Default AFIO mode                                       */
#define AFIO_FUN_GPIO       AFIO_MODE_1        /*!< AFIO mode GPIO                                          */
#define AFIO_FUN_SYSTEM     AFIO_MODE_15       /*!< AFIO mode System                                        */
#define AFIO_FUN_DAC0       AFIO_MODE_2        /*!< AFIO mode DAC0                                          */
#define AFIO_FUN_ADC0       AFIO_MODE_2        /*!< AFIO mode ADC0                                          */
#define AFIO_FUN_ADC1       AFIO_MODE_3        /*!< AFIO mode ADC1                                          */
#define AFIO_FUN_LEDC       AFIO_MODE_14       /*!< AFIO mode LEDC                                          */
#define AFIO_FUN_CMP        AFIO_MODE_3        /*!< AFIO mode CMP                                           */
#define AFIO_FUN_MCTM_GPTM  AFIO_MODE_4        /*!< AFIO mode MCTM/GPTM                                     */
#define AFIO_FUN_SCTM       AFIO_MODE_13       /*!< AFIO mode SCTM                                          */
#define AFIO_FUN_PWM        AFIO_MODE_13       /*!< AFIO mode PWM                                           */
#define AFIO_FUN_SPI        AFIO_MODE_5        /*!< AFIO mode SPI                                           */
#define AFIO_FUN_USART_UART AFIO_MODE_6        /*!< AFIO mode USART/UART                                    */
#define AFIO_FUN_I2C        AFIO_MODE_7        /*!< AFIO mode I2C                                           */
#define AFIO_FUN_SCI        AFIO_MODE_8        /*!< AFIO mode SCI                                           */
#define AFIO_FUN_CMP_OPA    AFIO_MODE_8        /*!< AFIO mode CMP/OPA                                       */
#define AFIO_FUN_EBI        AFIO_MODE_9        /*!< AFIO mode EBI                                           */
#define AFIO_FUN_I2S        AFIO_MODE_10       /*!< AFIO mode I2S                                           */
#define AFIO_FUN_CAN        AFIO_MODE_12       /*!< AFIO mode CAN                                           */
#define AFIO_FUN_TEKY       AFIO_MODE_12       /*!< AFIO mode TKEY                                          */
#define AFIO_FUN_LCD        AFIO_MODE_14       /*!< AFIO mode LCD                                           */
#define AFIO_FUN_SLED       AFIO_MODE_14       /*!< AFIO mode SLED                                          */

/* Definitions of AFIO_FUN alias                                                                            */
#define AFIO_FUN_MCTM0      AFIO_FUN_MCTM_GPTM

#define AFIO_FUN_GPTM0      AFIO_FUN_MCTM_GPTM
#define AFIO_FUN_GPTM1      AFIO_FUN_MCTM_GPTM
#define AFIO_FUN_GPTM2      AFIO_FUN_MCTM_GPTM
#define AFIO_FUN_GPTM3      AFIO_FUN_MCTM_GPTM

#define AFIO_FUN_PWM0       AFIO_FUN_PWM
#define AFIO_FUN_PWM1       AFIO_FUN_PWM
#define AFIO_FUN_PWM2       AFIO_FUN_PWM
#define AFIO_FUN_PWM3       AFIO_FUN_PWM

#define AFIO_FUN_SCTM0      AFIO_FUN_SCTM
#define AFIO_FUN_SCTM1      AFIO_FUN_SCTM
#define AFIO_FUN_SCTM2      AFIO_FUN_SCTM
#define AFIO_FUN_SCTM3      AFIO_FUN_SCTM

/* Definitions of GPIO_Px                                                                                   */
#define GPIO_PORT_NUM   (6)
#define GPIO_PIN_NUM    (16)
#define GPIO_PA         (0)
#define GPIO_PB         (1)
#if (LIBCFG_GPIOC)
#define GPIO_PC         (2)
#endif
#if (LIBCFG_GPIOD)
#define GPIO_PD         (3)
#endif
#if (LIBCFG_GPIOE)
#define GPIO_PE         (4)
#endif
#if (LIBCFG_GPIOF)
#define GPIO_PF         (5)
#endif

/* Definitions of GPIO port source for EXTI channel                                                         */
#define AFIO_ESS_PA GPIO_PA  /*!< EXTI channel x source come from GPIO Port A                               */
#define AFIO_ESS_PB GPIO_PB  /*!< EXTI channel x source come from GPIO Port B                               */
#if (LIBCFG_GPIOC)
#define AFIO_ESS_PC GPIO_PC  /*!< EXTI channel x source come from GPIO Port C                               */
#endif
#if (LIBCFG_GPIOD)
#define AFIO_ESS_PD GPIO_PD  /*!< EXTI channel x source come from GPIO Port D                               */
#endif
#if (LIBCFG_GPIOE)
#define AFIO_ESS_PE GPIO_PE  /*!< EXTI channel x source come from GPIO Port E                               */
#endif
#if (LIBCFG_GPIOF)
#define AFIO_ESS_PF GPIO_PF  /*!< EXTI channel x source come from GPIO Port F                               */
#endif

/* Definitions of GPIO_PIN                                                                                  */
#define GPIO_PIN_0    0x0001   /*!< GPIO pin 0 selected                                                     */
#define GPIO_PIN_1    0x0002   /*!< GPIO pin 1 selected                                                     */
#define GPIO_PIN_2    0x0004   /*!< GPIO pin 2 selected                                                     */
#define GPIO_PIN_3    0x0008   /*!< GPIO pin 3 selected                                                     */
#define GPIO_PIN_4    0x0010   /*!< GPIO pin 4 selected                                                     */
#define GPIO_PIN_5    0x0020   /*!< GPIO pin 5 selected                                                     */
#define GPIO_PIN_6    0x0040   /*!< GPIO pin 6 selected                                                     */
#define GPIO_PIN_7    0x0080   /*!< GPIO pin 7 selected                                                     */
#define GPIO_PIN_8    0x0100   /*!< GPIO pin 8 selected                                                     */
#define GPIO_PIN_9    0x0200   /*!< GPIO pin 9 selected                                                     */
#define GPIO_PIN_10   0x0400   /*!< GPIO pin 10 selected                                                    */
#define GPIO_PIN_11   0x0800   /*!< GPIO pin 11 selected                                                    */
#define GPIO_PIN_12   0x1000   /*!< GPIO pin 12 selected                                                    */
#define GPIO_PIN_13   0x2000   /*!< GPIO pin 13 selected                                                    */
#define GPIO_PIN_14   0x4000   /*!< GPIO pin 14 selected                                                    */
#define GPIO_PIN_15   0x8000   /*!< GPIO pin 15 selected                                                    */
#define GPIO_PIN_ALL  0xFFFF   /*!< GPIO all pins selected                                                  */

